# Solution- Basics- Selecting data using locations and indices

## Instant Review & Quiz

<b>I1. What is the differnce between index and series name?</b>

<font color = darkgreen><b>
    Index is an integer number that can be used to refer to a row or column. A series is a pandas object, more specific, a single column with still pandas formating. More than two series togehter then constitute the pandas dataframe.
</b></font>

<b>Q1. Two methods to select data are called ______</b><br>
.iloc() and .loc()<br>
.integerloc() and .location()<br>
.intergerlocation() and .location()<br>
.iloc and .loc

<font color = darkgreen><b>
    .iloc() and .loc()
</b></font>

<b>Q2. Pandas is a library.</b><br>
True<br>
False

<font color = darkgreen><b>
    True
</b></font>

## Practise

Start with reading the file 'West African Craton.csv' into a variable and displaying the categories in a compact form.<br>
Further, display the table, but with only 5 rows and columns

In [42]:
import pandas as pd

In [43]:
df = pd.read_csv('data/West African Craton.csv')

pd.set_option('display.max_rows', 5)
pd.set_option('display.max_columns', 5)

print(df.columns.tolist())

df

['Citations', 'Tectonic Setting', 'Location', 'Location Comment', 'Latitude (Min)', 'Latitude (Max)', 'Longitude (Min)', 'Longitude (Max)', 'Land or Sea', 'Elevation (Min)', 'Elevation (Max)', 'Sample Name', 'Rock Name', 'Age (a, Min)', 'Age (a, Max)', 'Geol', 'Age', 'Eruption Day', 'Eruption Month', 'Eruption Year', 'Rock Texture', 'Rock Type', 'Drill Depth (Min)', 'Drill Depth (Max)', 'Alteration', 'Mineral', 'Material', 'Si', 'Ti', 'B', 'Al', 'Cr', 'Fe3+', 'Fe2+', 'Fetot(2+)', 'Ca', 'Mg', 'Mn', 'Ni', 'K', 'Na', 'P', 'H2O', 'H2OP', 'H2OM', 'H2Otot', 'CO2', 'CO', 'F', 'Cl', 'Cl2', 'OH', 'CH4', 'SO2', 'SO3', 'SO4', 'S', 'LOI', 'Volatiles', 'O', 'Others', 'HE(CCM/G)', 'HE(CCMSTP/G)', 'HE3(CCMSTP/G)', 'HE3(AT/G)', 'HE4(CCM/G)', 'HE4(CCMSTP/G)', 'HE4(AT/G)', 'HE4(MOLE/G)', 'HE4(NCC/G)', 'HE(NCC/G)', 'Li', 'Be', 'B.1', 'C', 'CO2.1', 'F.1', 'Na.1', 'Al.1', 'P.1', 'S.1', 'Cl.1', 'K.1', 'Ca.1', 'Sc', 'Ti.1', 'V', 'Cr.1', 'Mn.1', 'Fe', 'Co', 'Ni.1', 'Cu', 'Zn', 'Ga', 'Ge', 'As', 'Se', 'Br', 'Rb', 'Sr', 'Y', 'Zr', 'Nb', 'Mo', 'Ru', 'Rh', 'Pd', 'Ag', 'Cd', 'In', 'Sn', 'Sb', 'Te', 'I', 'Cs', 'Ba', 'La', 'Ce', 'Pr', 'Nd', 'Sm', 'Eu', 'Gd', 'Tb', 'Dy', 'Ho', 'Er', 'Tm', 'Yb', 'Lu', 'Hf', 'Ta', 'W', 'Re', 'Os', 'Ir', 'Pt', 'Au', 'Hg', 'Tl', 'Pb', 'Bi', 'Th', 'U', 'Nd143/Nd144', 'Nd143/Nd144 initial', 'e Nd', 'Sr87/Sr86', 'SR87_SR86_INI', 'PB206_PB204', 'PB206_PB204_INI', 'PB207_PB204', 'PB207_PB204_INI', 'PB208_PB204', 'PB208_PB204_INI', 'OS184_OS188', 'OS186_OS188', 'OS187_OS186', 'OS187_OS188', 'RE187_OS186', 'RE187_OS188', 'HF176_HF177', 'HE3_HE4', 'HE3_HE4(R/R(A))', 'HE4_HE3', 'HE4_HE3(R/R(A))', 'K40_AR40', 'AR40_K40', 'Unique Id']

,Citations,Tectonic Setting,...,AR40_K40,Unique Id
0,[5205],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,184947
1,[5205],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,184948
...,...,...,...,...,...
41,[8624],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,247031
42,[8624],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,247032

Select the first 4 dataset.

In [44]:
df.iloc[:4]

,Citations,Tectonic Setting,...,AR40_K40,Unique Id
0,[5205],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,184947
1,[5205],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,184948
2,[5205],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,184949
3,[5205],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,184950

Select the series number 4, 17, and 99.

In [45]:
df.iloc[:, [4, 17, 99]]

    Latitude (Min)  Eruption Day    Rb
0              8.5           NaN   0.0
1              8.5           NaN   0.0
..             ...           ...   ...
41             9.5           NaN   4.0
42             9.5           NaN  39.0

[43 rows x 3 columns]

What types of rock (-> 'Rock Type') are represented in the database?

In [46]:
df['Rock Type'].drop_duplicates()

0        VOLCANIC ROCK
23    METAMORPHIC ROCK
38       PLUTONIC ROCK
Name: Rock Type, dtype: object

Select all metamorphick rocks. (This is a tricky one already.)

In [47]:
df.set_index('Rock Type', inplace = True)

df

,Citations,Tectonic Setting,...,AR40_K40,Unique Id
Rock Type,,,,,
VOLCANIC ROCK,[5205],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,184947
VOLCANIC ROCK,[5205],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,184948
...,...,...,...,...,...
METAMORPHIC ROCK,[8624],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,247031
METAMORPHIC ROCK,[8624],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,247032

In [48]:
df.loc['METAMORPHIC ROCK']

,Citations,Tectonic Setting,...,AR40_K40,Unique Id
Rock Type,,,,,
METAMORPHIC ROCK,[8624],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,247013
METAMORPHIC ROCK,[8624],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,247014
...,...,...,...,...,...
METAMORPHIC ROCK,[8624],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,247031
METAMORPHIC ROCK,[8624],ARCHEAN CRATON (INCLUDING GREENSTONE BELTS),...,NaN,247032

Again, select all metamorphic rocks, but only display the series 'Mg' and 'Ti'.

In [49]:
df.loc['METAMORPHIC ROCK', ['Mg', 'Ti']]

                          Mg         Ti
Rock Type
METAMORPHIC ROCK   48243.200   6592.740
METAMORPHIC ROCK   34373.280  10788.120
...                      ...        ...
METAMORPHIC ROCK  151845.472    659.274
METAMORPHIC ROCK  246643.360   1618.218

[19 rows x 2 columns]

Reset the indices first, then select datasets 10 throughout and including 20, but only with the columns MgO and Cr2O3.

In [50]:
df.reset_index(inplace = True)

df

           Rock Type Citations  ... AR40_K40 Unique Id
0      VOLCANIC ROCK    [5205]  ...      NaN    184947
1      VOLCANIC ROCK    [5205]  ...      NaN    184948
..               ...       ...  ...      ...       ...
41  METAMORPHIC ROCK    [8624]  ...      NaN    247031
42  METAMORPHIC ROCK    [8624]  ...      NaN    247032

[43 rows x 170 columns]

In [51]:
df.loc[10:21, ['Si', 'Fe', 'Mn']]

             Si  Fe         Mn
10  226705.9750 NaN  1626.3618
11  234699.1135 NaN  1394.0244
..          ...  ..        ...
20  230866.1465 NaN  1626.3618
21  249703.7770 NaN  1936.1450

[12 rows x 3 columns]